import RoadmapContent from './roadmapContent';
import RoadmapItem from './roadmapItem';
import Image from 'next/image';


const RoadmapSection = () => {
    return (
        <div className="section roadmap">
            <Image
                src="/images/globe-roadmap.png"
                className="roadmap-shape"
                alt="globe bg for roadmap"
                width={1500}
                height={1500}
            />
            <div className="container">
                <div className="row align-items-center justify-content-between">
                    <div className="col-lg-5">
                        <div className="roadmap-wrapper" id="roadmap-wrapper">

                            <RoadmapItem
                                icon={`roadmap1.svg`}
                                number={1}
                                title="جلسه برسی نیاز های مشتری"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap2.svg`}
                                number={2}
                                title="ارسال پلن و پروپوزال"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap3.svg`}
                                number={3}
                                title="عقد قرارداد"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap4.svg`}
                                number={4}
                                title="برگذاری جلسه اولیه با کارشناسان ما"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap5.svg`}
                                number={5}
                                title="طراحی هویت بصری"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap6.svg`}
                                number={6}
                                title="راه اندازی سوشال مدیا"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap7.svg`}
                                number={7}
                                title="هماهنگی جهت تهیه مدیا های اولیه"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap8.svg`}
                                number={8}
                                title="طراحی رابط کاربری وبسایت و پیاده سازی"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap9.svg`}
                                number={9}
                                title="ارائه تقویم محتوایی سایت"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap10.svg`}
                                number={10}
                                title="راه اندازی پروفایل نوبت دهی آنلاین"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />

                            <RoadmapItem
                                icon={`roadmap11.svg`}
                                number={11}
                                title="ارائه کمپین های تبلیغاتی"
                                desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                            />
                        </div>
                    </div>

                    <div className="col-lg-6">

                        <RoadmapContent
                            title={`نــــقــــشــــه  راه  مــــشـــتـــریــان`}
                            goldTitle={`مـاورانـت`}
                            desc={`لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.
                                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.`}
                        />

                    </div>
                </div>
            </div>
        </div>
    )
}

export default RoadmapSection